Splatoon2MapMaster/app/controllers/area_controller.rb

  def display
    @weaponData = Weapon.all
---
SELECT "weapons".* FROM "weapons"

  def freePage
    @weaponData = Weapon.all
---
SELECT "weapons".* FROM "weapons"