CallCenter/app/controllers/contracts_controller.rb

SELECT "contracts".* FROM "contracts" WHERE "contracts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @contract = Contract.find( params[:id] )